** source block B-4, 權屬別及型態別其代號與名稱

#+HEADERS: :noweb yes
#+HEADERS: :results raw
#+HEADERS: :session
#+BEGIN_SRC sh
 <<the_pdf_name_block>>

            pdftotext -f 6 -l 10 -nopgbrk -raw $the_pdf_filename -

#+END_SRC

#+RESULTS:
B-4 權屬別及型態別其代號與名稱

一、醫療機構

| 權屬別 |                              |
|     01 | 署、市立醫院                 |
|     02 | 縣市立醫院                   |
|     04 | 公立醫學院校附設醫院         |
|     05 | 軍方醫院(民眾診療)           |
|     06 | 榮民醫院                     |
|     07 | 機關(構)附設醫院             |
|     08 | 公立中醫醫院                 |
|     09 | 社團法人醫院                 |
|     10 | 宗教社團法人附設醫院         |
|     11 | 財團法人醫院                 |
|     12 | 宗教財團法人附設醫院         |
|     13 | 私立醫學院校附設醫院         |
|     14 | 其他法人附設醫院             |
|     15 | 私立醫院                     |
|     17 | 私立牙醫醫院                 |
|     18 | 私立中醫院                   |
|     21 | 市立診所                     |
|     22 | 縣市立診所                   |
|     23 | 衛生所                       |
|     24 | 公立學校附設醫務室           |
|     25 | 軍方診所(民眾診療附設門診部) |
|     26 | 榮民診所(榮家醫務室)         |
|     27 | 機關(構)附設醫務室           |
|     28 | 公立中醫診所                 |
|     29 | 公益法人所設診所             |
|     30 | 公益法人所設醫務室           |
|     31 | 財團法人附設醫務室           |
|     32 | 宗教財團法人附設診所、醫務室 |
|     33 | 私立學校附設醫務室           |
|     34 | 事業單位附設醫務室           |
|     35 | 私立診所                     |
|     37 | 私立牙醫診所                 |
|     38 | 私立中醫診所                 |
|     40 | 醫療財團法人診所             |
|     41 | 醫療社團法人診所             |
|     42 | 財團法人其他醫療機構         |
|     45 | 私立其他醫療機構             |


|              型態別 |                  |
|---------------------+------------------|
|         醫院：01-08 |                  |
|                  01 | 綜合醫院         |
|                  02 | 醫院             |
|                  03 | 專科醫院         |
|                  04 | 精神科醫院       |
|                  05 | 特殊科醫院       |
|                  06 | 慢性醫院         |
|                  07 | 專科診所         |
|                  08 | 一般診所(醫務室) |
|                  09 | 特殊科診所       |
|---------------------+------------------|
|         牙醫：11-13 |                  |
|                  11 | 牙醫醫院         |
|                 B-5 |                  |
|                  12 | 牙醫專科診所     |
|                  13 | 牙醫一般診所     |
|---------------------+------------------|
|         中醫：21-24 |                  |
|                  21 | 中醫綜合醫院     |
|                  22 | 中醫醫院         |
|                  23 | 中醫專科診所     |
|                  24 | 中醫一般診所     |
|---------------------+------------------|
| 其他醫療機構：41-43 |                  |
|                  41 | 捐血中心         |
|                  42 | 捐血站           |
|                  43 | 病理中心         |

二、藥商

|            權屬別 |                |
|-------------------+----------------|
| 販賣業：51-53、62 |                |
|                51 | 西藥販賣業     |
|                52 | 中藥販賣業     |
|                53 | 醫療器材販賣業 |
|                62 | 販賣業         |
|-------------------+----------------|
| 製造業：54-58、61 |                |
|                54 | 西藥製造業     |
|                55 | 中藥製造業     |
|                56 | 醫療器材製造業 |
|                57 | 明膠膠囊製造業 |
|                58 | 化妝品製造業   |
|                61 | 製造業         |
|-------------------+----------------|
|       其他：59-60 |                |
|                59 | 藥局           |
|                60 | 列冊中藥商     |



| 型態別 |                                    |
|--------+------------------------------------|
|     01 | 藥師自營                           |
|     02 | 藥劑生自營                         |
|     03 | 藥師駐店管理                       |
|     04 | 藥劑生駐店管理                     |
|     05 | 符合藥事法104條規定─藥師管理       |
|     06 | 符合藥事法104條規定─藥劑生管理     |
|     07 | 中醫師駐店管理                     |
|     08 | 中醫師兼管                         |
|     09 | 藥師兼管                           |
|     11 | 確具中藥基本知識及鑑別能力人員管理 |
|     12 | 人用生物藥品製造廠                 |
|     13 | 藥師監製                           |
|     14 | 中醫師監製                         |
|     16 | 列冊中藥商                         |


三、護理護產機構


| 權屬別 |                              |
|--------+------------------------------|
|     71 | 公立護產機構                 |
|     72 | 財團法人護產機構             |
|     73 | 其他法人附設護產機構         |
|     74 | 個人開設護產機構             |
|     75 | 公立醫療機構附設護產機構     |
|     76 | 私立醫療機構附設護產機構     |
|     77 | 財團法人醫療機構附設護產機構 |
|     78 | 其他                         |
|     79 | 社團法人醫療機構附設護產機構 |


| 型態別 |                            |
|--------+----------------------------|
|     01 | 護理之家                   |
|     02 | 居家護理                   |
|     03 | 產後護理                   |
|     04 | 助產所                     |
|     05 | 學校醫務室─校護            |
|     06 | 事業單位醫務室─廠護        |
|     07 | 社會福利機構               |
|     08 | 機關醫護室                 |
|     09 | 學校護理教育(實習指導老師) |
|     10 | 日間照護                   |
|     00 | 其他                       |


四、精神復健機構

| 權屬別 |                                  |
|--------+----------------------------------|
|     81 | 公立精神復健機構                 |
|     82 | 財團法人精神復健機構             |
|     83 | 其他法人附設精神復健機構         |
|     84 | 私立精神復健機構                 |
|     85 | 公立醫療機構附設精神復健機構     |
|     86 | 私立醫療機構附設精神復健機構     |
|     87 | 財團法人醫療機構附設精神復健機構 |
|     88 | 精神衛生團體附設精神復健機構     |


| 型態別 |              |
|--------+--------------|
|     08 | 社區復健中心 |
|     09 | 康復之家     |



五、其他醫事機構

| 權屬別 |                                  |
|--------+----------------------------------|
|     91 | 公立其他醫事機構                 |
|     92 | 財團法人其他醫事機構             |
|     93 | 其他法人附設其他醫事機構         |
|     94 | 私立其他醫事機構                 |
|     95 | 公立醫療機構附設其他醫事機構     |
|     96 | 私立醫療機構附設其他醫事機構     |
|     97 | 財團法人醫療機構附設其他醫事機構 |
|     98 | 其他                             |
|     xx | 不詳                             |



| 型態別 |                    |
|--------+--------------------|
|     01 | 醫事檢驗所         |
|     02 | 醫事放射所         |
|     03 | 物理治療所         |
|     04 | 職能治療所         |
|     05 | 鑲牙所             |
|     06 | 齒模製造技術員     |
|     07 | 國術損傷接骨技術員 |
|     00 | 其他               |
|     xx | 不詳               |



** source block B-53 專科醫師代號、科別

#+HEADERS: :noweb yes
#+HEADERS: :results raw
#+HEADERS: :session
#+BEGIN_SRC sh
#  the_pdf_filename="en_codeformat.pdf"  #A
 the_pdf_filename="en_codedescribe.pdf"  #B

            pdftotext -f 55 -l 56 -nopgbrk -raw $the_pdf_filename -

#+END_SRC

#+RESULTS:
B-53
專科醫師代號、科別
| 代號         | 專科別           |
| A0100        | 家庭醫學科       |
| A0200        | 內科             |
| A0201        | 心臟專科         |
| A0202        | 腎臟科           |
| A0203        | 胸腔暨重症專科   |
| A0204        | 心臟外專科       |
| A0205        | 心臟血管外科     |
| A0206        | 胸腔外科         |
| A0207        | 結核病專科       |
| A0208        | 感染症專科       |
| A02AA        | 新陳代謝科       |
| A0299        | 職業病科         |
| A0300        | 外科             |
| A0301        | 整形外科         |
| A0400        | 小兒科           |
| A0500        | 婦產科           |
| A0600        | 骨科             |
| A0700        | 神經科           |
| A0800        | 神經外科         |
| A0900        | 泌尿科           |
| A1000        | 耳鼻喉科         |
| A1100        | 眼科             |
| A1200        | 皮膚科           |
| A1300        | 精神科           |
| A1400        | 復健科           |
| A1500        | 麻醉科           |
| A1600        | 放射線科（診斷） |
| A1610        | 放射線科（腫瘤） |
| A1620        | 放射線科（核醫） |
| A2000        | 病理科（解剖）   |
| A2010        | 病理科（臨床）   |
| A2100        | 核子醫學科       |
| A0299        | 職業病科         |
| A2200        | 急診醫學科       |
| A2400        | 職業醫學科       |
| A2500        | 口腔顎面外科     |
| C0700        | 口腔顎面外科     |
| B0100        | 中醫內科         |
| B0200        | 中醫外科         |
| B0300        | 中醫婦科         |
| B0400        | 中醫兒科         |
| B0600        | 中醫眼科         |
| C0100        | 牙科不分科       |
| C0900        | 口腔病理科       |




